# Python Package
from flask import Flask
from dotenv import load_dotenv
import os

load_dotenv()  # تحميل المتغيرات من .env

from flask_login import LoginManager
from .database import db
import json
from .models import Available_stories

DB_NAME = os.getenv("DB_NAME") # Schema Name
DB_USER = os.getenv("DB_USER")
DB_PASSWORD = os.getenv("DB_PASSWORD")
DB_HOST = os.getenv("DB_HOST")

# Start Add Stories
def add_stories(app, db):
    stories = [
        {
            "title": "ذات الرداء الأحمر",
            "content":  [
                    "كان يا ما كان، في قديم الزمان، فتاة صغيرة طيبة القلب تُدعى 'ذات الرداء الأحمر'، وذلك بسبب رداء أحمر جميل أهَدته لها جدتها، وكانت ترتديه دائمًا.في يوم من الأيام، قالت لها والدتها:\n'يا ابنتي العزيزة، جدتكِ مريضة وتعيش وحدها في الغابة. خذي لها هذه السلة التي تحتوي على كعك وعصير لتقويتها. تذكري ألا تخرجي عن الطريق، ولا تضيعي الوقت.'\nوعدت ذات الرداء الأحمر أمها بأنها ستكون حذرة، وانطلقت نحو الغابة. كان يومًا مشرقًا، والغابة تبدو هادئة وجميلة.",
                    "بينما كانت ذات الرداء الأحمر تسير في الغابة، ظهر لها ذئب كبير بدا ودودًا.\n\nقال الذئب بمكر: 'إلى أين أنتِ ذاهبة يا صغيرة؟'\n ردت ذات الرداء الأحمر:'أنا ذاهبة إلى بيت جدتي المريضة لأعطيها بعض الطعام.'\nسألها الذئب: 'وأين تعيش جدتكِ؟'\nأجابته:'تحت ثلاثة أشجار بلوط كبيرة في الغابة.'\nفكر الذئب بخطة شريرة وقال: 'ما رأيكِ أن تجمعي بعض الزهور الجميلة لجدتكِ؟ ستفرح كثيرًا بها.'\n\nوافقت ذات الرداء الأحمر، وبدأت تقطف الزهور، مما جعلها تبتعد عن الطريق.",
                    "استغل الذئب فرصة انشغال الفتاة بالزهور وركض سريعًا إلى بيت الجدة. طرق الباب قائلاً بصوت ناعم: 'أنا ذات الرداء الأحمر، أحضرت لكِ كعكًا وعصيرًا.'\nردت الجدة من الداخل: 'ادخلي، الباب مفتوح.'\nدخل الذئب المنزل وانقض على الجدة وأكلها، ثم ارتدى ملابسها واستلقى في سريرها منتظرًا ذات الرداء الأحمر.\nعندما وصلت الفتاة إلى المنزل، لاحظت أن الباب مفتوح قليلاً وشعرت بالقلق. دخلت وقالت: 'صباح الخير يا جدتي!'",
                    "اقتربت ذات الرداء الأحمر من السرير ولاحظت أن 'جدتها' تبدو غريبة. فقالت:'ما أكبر أذنيكِ!' فأجاب الذئب: 'لكي أسمعكِ جيدًا.' \nثم قالت: 'ما أكبر عينيكِ!' فأجاب: 'لكي أراكِ جيدًا.'\nوأخيرًا قالت: 'ما أكبر فمكِ!' فرد الذئب: 'لكي آكلكِ!'\nقفز الذئب وابتلع الفتاة. ولكن لحسن الحظ، كان هناك صياد يمر قرب المنزل. دخل الصياد ورأى الذئب نائمًا، فشَق بطنه ووجد الجدة وذات الرداء الأحمر سالمتين.\nملأ الصياد بطن الذئب بالحجارة وأغلقه. عندما استيقظ الذئب حاول الهرب لكنه سقط ميتًا.\nشكرت ذات الرداء الأحمر وجدتها الصياد على شجاعته، وقالت الفتاة:'تعلمت درسًا. لن أخرج عن الطريق مرة أخرى.' ثم عادت إلى بيتها بأمان."
                    ], 
            "imgSrc": "images/ذات الرداء الأحمر.jpg",
            "audioSrc": [
                "audio/our_library/ذات الرداء الأحمر_1.mp3",
                "audio/our_library/ذات الرداء الأحمر_2.mp3",
                "audio/our_library/ذات الرداء الأحمر_3.mp3",
                "audio/our_library/ذات الرداء الأحمر_4.mp3",
            ]
        },
        {
        "title": "التمرة الضائعة",
        "content": [
            "في قرية صغيرة في نجد، حيث تملأ مزارع النخيل الأفق، عاشت فتاة تُدعى ليان مع عائلتها. والدها كان يرعى مزرعة نخيل ويكرر لها دائمًا: '\nالنخلة رمز الخير، والتمر رزقٌ مبارك.'\n في صباحٍ جميل، وأثناء مساعدتها لوالدها في جمع التمر، لاحظت ليان تمرة كبيرة وشديدة الحلاوة سقطت على الأرض. فرحت بها وقررت الاحتفاظ بها لتأكلها لاحقًا، فوضعتها بعناية في حقيبتها الصغيرة.",
            "عندما عادت ليان للمنزل، اكتشفت أن التمرة اختفت، ما أشعرها بالحزن والقلق. فكرت مليًا وسألت نفسها: '\nأين ذهبت التمرة؟ هل سقطت في الطريق، أم أخذها أحد؟'\n لم تستسلم وقررت العودة إلى المزرعة للبحث عنها. أثناء سيرها، لاحظت آثار أقدام صغيرة تقود إلى زاوية في الحقل. عندما تتبعتها، اكتشفت أن عصفورًا ضعيفًا يحاول كسر التمرة لكنه لم يستطع ذلك.",
            "اقتربت ليان بهدوء من العصفور وقالت بابتسامة: '\nأنت من أخذ التمرة! ثم نظرت إليه ورأت أنه يبدو جائعًا وضعيفًا.'\n بعد تردد بسيط، فكرت في أن التمرة قد تكون رزقًا للعصفور كما أن التمور رزق لعائلتها. قررت أن تساعده؛ حملت التمرة وساعدته على كسرها '\n. أكل العصفور بشهية، ثم بدأ يرفرف حول ليان وكأنه يشكرها على فعلتها الطيبة.",
            "عادت ليان إلى المنزل وحكت الحكاية لوالدها، الذي ابتسم بفخر وقال لها: '\nيا ليان، الخير لا يُحفظ، بل يُعطى. الله يرزق الجميع، ومن يعطي يُبارك له.\n تعلمت ليان درسًا مهمًا: أن السعادة تكمن في مساعدة الآخرين، وأن الرحمة تشمل كل مخلوقات الله. أدركت أن العطاء يجلب الفرح الحقيقي، ولو كان بسيطًا، كتمرةٍ شاركتها مع عصفور صغير."
        ],
        "imgSrc": "images/التمرة الضائعة.jpeg",
        "audioSrc": [
            "audio/our_library/التمره الضائعة_1.mp3",
            "audio/our_library/التمره الضائعة_2.mp3",
            "audio/our_library/التمره الضائعة_3.mp3",
            "audio/our_library/التمره الضائعة_4.mp3"
        ]
        },
        {
            "title": "الأرنب المشاغب باسل",
            "content":  [
                    "في غابة جميلة، عاشت الأرنبة لينا مع أبنائها الأربعة: فلة، مرمر، روان، وباسل، تحت شجرة كبيرة. كانت دائمًا تحذرهم من المخاطر.\nفي صباحٍ هادئ، قالت لهم بلهجة جادة: 'لا تدخلوا حديقة السيد محمود. رغم أن فيها خضروات شهية، إلا أنها مليئة بالمصائد. والدكم وقع في واحدة هناك' وافق الجميع على التحذير.\nبينما خرجت فلة ومرمر وروان لجمع التوت، قرر باسل تجاهل التحذير والمغامرة.",
                    "انتظر باسل حتى غادر الجميع ثم توجه للحديقة.\nوجد الباب مفتوحًا قليلاً، فانسل إلى الداخل.\nاندهش برؤية الجزر، الخس، والخضروات الطازجة. بدأ يأكل بشراهة، ناسيًا تحذير والدته. \nوبينما كان يستمتع، سمع صوت خطوات خلفه.\nاستدار ليجد السيد محمود يقترب حاملاً عصاه وهو يصرخ: 'أيها الأرنب اللص!' حاول باسل الهرب، لكنه علقت قدماه في شبكة صغيرة.",
                    "علق باسل بالشبكة، لكنه بذل جهدًا كبيرًا لتحرير نفسه. فقد معطفه وحذاءيه الجديدين، وركض بأسرع ما يمكن.\n بحث عن مخرج فرأى نافذة صغيرة في سقيفة الأدوات وقفز منها بصعوبة.\n عندما خرج، ركض نحو بوابة الحديقة المفتوحة واندفع إلى الخارج.\n ظل يجري بين الأشجار حتى تأكد أن السيد محمود لم يعد يلاحقه. وصل إلى البيت منهكًا ومبللًا، وشعر بالخجل من والدته.",
                    "رأت الأم حالة باسل المتعبة فقالت بهدوء: 'ما الذي حدث؟' روى لها القصة وهو يشعر بالخجل.\n قالت الأم: 'لقد فقدت معطفك وحذاءيك، لكنك تعلمت درسًا مهمًا اليوم.\n' أحضرت له شاي دافئا ليساعده على الراحة.\n بينما تناول إخوته العشاء، شعر باسل بالحزن لأنه لم يشاركهم.\n قبل النوم، وعد والدته أن يلتزم بنصائحها دائمًا.\n نام مطمئنًا وقد تعلم أن الطاعة تحمي من الأخطار."
                    ], 
            "imgSrc": "images/الأرنب المشاغب.jpeg",
            "audioSrc": [
                "audio/our_library/الأرنب المشاغب_1.mp3",
                "audio/our_library/الأرنب المشاغب_2.mp3",
                "audio/our_library/الأرنب المشاغب_3.mp3",
                "audio/our_library/الأرنب المشاغب_4.mp3",
            ]
        },
        {
            "title": "راكان والكنز ",
            "content": [
                "في قرية صغيرة بالقرب من جبال عسير، كان هناك فتى صغير يُدعى \"راكان\". كان يعيش مع جده الحكيم الذي يحب سرد القصص. ذات يوم، أعطى الجد راكان خريطة قديمة قائلاً: \"هذه تقود إلى كنز ثمين، لكنه ليس كنزًا عاديًا. عليك أن تُظهر شجاعتك وذكاءك لتجده.\" انطلق راكان في المغامرة بحماسة. بدأ بالتوجه إلى واحة صغيرة كما أوضحت الخريطة.",
                "تابع راكان رحلته حتى وصل إلى سفح جبل. وجد هناك طفلًا يبكي لأنه فقد عنزته. قرر راكان أن يساعده، فبحث معه في كل مكان حتى وجد العنز الصغيرة عالقة بين الصخور. قال الطفل: \"شكراً يا راكان! أنت بطل حقيقي.\" بعد مساعدة الطفل، شعر راكان بالفرح والرضا، وتأكد أن الخير الذي يقدمه للآخرين هو مكافأة بحد ذاته. عاد للتركيز على الخريطة التي قادته هذه المرة عبر وادٍ مليء بالصخور.",
                "عندما عبر راكان الوادي، وجد مزارعًا يحاول حماية حقله من مجموعة من الطيور التي كانت تأكل المحاصيل. قرر راكان مساعدته، فجمع بعض الأغصان وصنع دمية تخيف الطيور. قال المزارع: \"جزاك الله خيرًا يا بني! أنت حقًا شخص نادر.\" ابتسم راكان وأكمل رحلته. أخيرًا، وصلت الخريطة به إلى كهف صغير كما أشارت الإرشادات. كانت أضواء الشمس الخافتة تتسلل من بين الصخور، مما أضفى أجواءً ساحرة على المكان.",
                "داخل الكهف، وجد راكان صندوقًا صغيرًا. عندما فتحه، لم يجد الذهب أو المجوهرات، بل وجد رسالة مكتوبة بخط جده. كان مكتوبًا فيها: \"يا راكان، الكنز الحقيقي ليس في المال، بل في الخير الذي تزرعه في قلوب الناس. الرحمة والشجاعة هما أغلى ما يمكن أن تملكه. أنا فخور بك.\" عاد راكان إلى جده مبتسمًا، وقال: \"الكنز كان أكبر مما توقعت يا جدي. تعلمت أن الكرم والشجاعة هما ما يجعلنا أغنياء حقًا.\""
            ],
            "imgSrc": "images/راكان والكنز .jpeg",
            "audioSrc": [
                "audio/our_library/راكان والكنز 1.mp3",
                "audio/our_library/راكان والكنز 2.mp3",
                "audio/our_library/راكان والكنز 3.mp3",
                "audio/our_library/راكان والكنز 4.mp3"
            ]
        },
        {
            "title":"علاء الدين",
            "content": [
                "في قَديمِ الزمانِ، كانَ هناكَ شابٌّ فَقيرٌ يُدعى 'علاءُ الدِّينِ' يعيشُ مع والدتِهِ في بَلدةٍ صغيرةٍ. كانَ علاءُ الدِّينُ مَعرُوفًا بِفُضُولِهِ وحُبِّهِ لِلمَغامَرَةِ.\nفي يَومٍ مِنَ الأَيَّامِ، وَصَلَ إلى البَلدةِ رَجُلٌ غريبٌ ادَّعى أَنَّهُ عَمُّ علاءِ الدِّينِ.\nلكنَّهُ في الحَقيقَةِ كانَ ساحِرًا شِرِّيرًا يَبحَثُ عن كَنزٍ سِحريٍّ مَخفِيٍّ في كَهفٍ بَعيدٍ.",
                "أَقنَعَ السَّاحِرُ علاءَ الدِّينِ بِمُساعدَتِهِ لاستِعادَةِ الكَنزِ السِّحريِّ، ووَعَدَهُ بِمُكافَأَةٍ كَبيرةٍ.\nداخِلَ الكَهفِ، وَجَدَ علاءُ الدِّينُ مِصبَاحًا قَديمًا.\nلكنَّ السَّاحِرَ غَدَرَ بِهِ وَتَرَكَهُ مَحصُورًا في الدَّاخلِ.\nفَرَكَ علاءُ الدِّينُ المِصبَاحَ بِيَأسٍ، فَظَهَرَ جِنِّيٌّ قَوِيٌّ يَقُولُ: 'أَنَا خَادِمُ المِصبَاحِ، مُرني وَسَأُطِيعُكَ.'",
                "طَلَبَ علاءُ الدِّينُ مِنَ الجِنِّيِّ أَن يُحرِّرَهُ مِنَ الكَهفِ، وَعَادَ إلى المَنزِلِ بِسَلامٍ.\nاستَخدَمَ علاءُ الدِّينُ قُوَّةَ الجِنِّيِّ لِتحسِينِ حَياتِهِ وَحَياةِ والدَتِهِ.\nأَصبَحَ ثَرِيًّا، وَبَنَى قَصرًا رائِعًا، وَقَرَّرَ أَن يَطلُبَ يَدَ الأَمِيرَةِ بَدْرِ البُدورِ، أَجمَلِ فَتاةٍ في المَملَكَةِ.",
                "لكنَّ السَّاحِرَ الشِّرِّيرَ خَدَعَ الأَمِيرَةَ وسَرَقَ المِصبَاحَ، مُحاوِلًا تَدمِيرَ علاءِ الدِّينِ.\nبِشَجاعَتِهِ وَذَكَائِهِ، استَعادَ علاءُ الدِّينُ المِصبَاحَ وَهَزَمَ السَّاحِرَ.\nتَعَلَّمَ علاءُ الدِّينُ أَنَّ القُوَّةَ الحَقيقِيَّةَ تَكمُنُ في الشَّجاعَةِ وَالذَّكَاءِ، وَعَاشَ مَعَ الأَمِيرَةِ بِسَعادَةٍ إِلَى الأَبَدِ."
            ],
            "imgSrc": "/images/علاء الدين.jpeg",
            "audioSrc": [
                "audio/our_library/علاء الدين1.mp3",
                "audio/our_library/علاء الدين2.mp3",
                "audio/our_library/علاء الدين3.mp3",
                "audio/our_library/علاء الدين4.mp3"
            ],
        },
        {
            "title": "جاك وحبة الفاصولياء",
            "content": [
                "في قَديمِ الزمانِ، كانَ جاكُ يعيشُ مع والدتِهِ الأرملةِ في فَقرٍ شَديدٍ.\nكانتِ العائلةُ تعتمدُ على بَقَرَةٍ اسمُها 'أَبيضُ الحَليبِ' لِتَوفيرِ الطَّعامِ.\nلكنَّ البَقَرَةَ توقَّفَت عن إنتَاجِ الحَليبِ.\nطَلَبَت الأُمُّ من جاك أنْ يَبيعَ البَقَرَةَ في السُّوقِ لِيَشتري الطَّعامَ.\nفي طريقِهِ، التقى جاكُ برَجُلٍ غامِضٍ عَرَضَ عليهِ خَمسَ حَبَّاتِ فاصولياءِ سِحريَّةٍ مُقابِلَ البَقَرَةِ.",
                "شَعَرَ جاكُ بِالحَماسِ وقَبِلَ الصَّفقةَ، وعادَ إلى المَنزِلِ بِالحَبَّاتِ السِّحريَّةِ.\nلكنَّ والدَتَهُ غَضِبَت وألقَتِ الحَبَّاتِ من النَّافِذَةِ، مُعتَقِدَةً أنَّها عديمَةُ الفائِدَةِ.\nفي صَباحِ اليَومِ التَّالي، استَيقَظَ جاكُ لِيَجِدَ شَجَرَةَ فَاصوليا عِملاقةً تَمتَدُّ إلى السَّماءِ.\nقَرَّرَ جاكُ تَسلُّقَ الشَّجَرَةِ لِيَكتَشِفَ ما في الأعلى.",
                "في قِمَّةِ الشَّجَرَةِ، وجَدَ جاكُ قَلْعَةً بينَ السَّحابِ يَسكُنُها عِملاقٌ وزَوجَتُهُ.\nداخِلَ القَلْعَةِ، رَأى جاكُ كُنوزًا مُذهِلَةً: دَجاجَةً تَبِيضُ ذَهبًا، وقِيثارَةً ذَهَبِيَّةً تُعزِفُ الموسيقى تِلقائيًّا.\nقَرَّرَ جاكُ أَخذَ القِيثارَةِ والدَّجاجَةِ.\nأَثناءَ هُروبِهِ، بَدَأَتِ القِيثارَةُ تَصرُخُ طَلَبًا لِلمُساعَدَةِ، مِمَّا أَيقَظَ العِملاقَ.",  
                "طارَدَهُ العِملاقُ، لكنَّ جاكَ تَسَلَّقَ الشَّجَرَةَ بِسُرعَةٍ وصَاحَ لِوالِدَتِهِ يَطلُبُ مُساعَدَتَهُ.\nمَعًا قَطَعَا الشَّجَرَةَ قَبلَ أنْ يَتمَكَّنَ العِملاقُ مِنَ النُّزولِ.\nسَقَطَ العِملاقُ واختَفَى.\nعاشَ جاكُ ووالدتُهُ بِسَعادَةٍ مع الدَّجاجَةِ والقِيثارَةِ السِّحريَّةِ، دونَ الحاجَةِ لِلقَلَقِ بِشَأنِ المَالِ مَرَّةً أُخرى."
            ],
            "imgSrc": "images/جاك وحبة الفاصولياء.png",
            "audioSrc": [
                "audio/our_library/جاك1.mp3",
                "audio/our_library/جاك2.mp3",
                "audio/our_library/جاك3.mp3",
                "audio/our_library/جاك4.mp3"
            ],
        },
        {
            "title": " نور والألوان المفقوده ",
            "content":  [
                "في بلدة صغيرة محاطة بالزهور والأشجار، كانت تعيش فتاة تُدعى “نور”. كانت رسامة بارعة، تحب رسم المناظر الطبيعية والبساتين والأطفال وهم يلعبون. كانت فرشاتها وألوانها تُضيف البهجة لكل مكان تذهب إليه. إذا مر أحدهم بيوم حزين، كانت نور ترسم له صورة مفعمة بالألوان، تُعيد إليه الابتسامة. ذات صباح غريب، استيقظت نور لتجد أن قريتها قد تغيرت. اختفت جميع الألوان فجأة! الزهور التي كانت تتمايل بألوانها البهيجة أصبحت رمادية، الأشجار فقدت خُضرتها، السماء أصبحت شاحِبة، وحتى ثياب الناس تحولت إلى درجات باهتة.\n",
                "حزن أهل القرية حزنًا شديدًا، وشعروا بأن الحياة أصبحت كئيبة بلا ألوان. اجتمعُوا في ساحة القرية، يتساءلون عن السبب وراء هذا التغير الغريب. بدأت نور في البحث عن السبب وراء اختفاء الألوان، ذهبت نور إلى الحكيم العجوز في القرية وسألته: “لماذا اختفت الألوان يا جدي؟ وكيف يمكننا إعادتها؟” أجاب الحكيم: “الألوان ليست مجرد شيء نراه بِأعيننا، يا نور. إنها إنعكاس لما في قلوبنا. عندما ينسى الناس قيمًا مثل العطاء، والاحترام، وحُب الآخرين. لإعادتها، عليكِ أن تبحثي عن هذه القيم في قلوب الناس وتُحييها” قالت سأحاول!\n",
                "بدأت نور جولتها في القرية. مرّت أولًا بمجموعة أطفال يتشاجرون على كرة. كل واحد منهم يُريدها لنفسه فتدخلت وقالت:“لماذا تتشاجرون؟ اللعب أجمل عندما نلعب معًا”صمت الأطفال ثم قرروا أن يلعبوا سويًا، وبمجرد أن تبادلوا الكرة،عاد اللون الأحمر فجأة إلى الكرة.ثم تابعت رحلتها. في الطريق، رأت عجوزًا تحاول حمل سلة ثقيلة مليئة بالخضروات. فتقدمت وساعدتها. شكرتها العجوز بحرارة، وفجأة،عادت الألوان الزاهية إلى الأزهار المحيطة بالمنزل.رأت شابًا غاضبًا يتجادل مع صديقه، فاقتربت منهما وساعدتهما على التصالح.وعادت الألوان\n",
                "رأت طفلة تبكي لأنها أضاعت دميتها، فجلست معها حتى وجدتها، وعادت الألوان إلى السماء فوقهم. لم يكن الأمر سهلًا دائمًا لكن استمرت نور في نشر القيم الطيبة، كالتسامح، والعطف، والابتسامة، وكلما فعلت ذلك، عادت الألوان تدريجيًا إلى القرية. اجتمع أهل القرية مرة أخرى في الساحة. كانت الألوان قد عادت تمامًا، بل أصبحت أجمل مما كانت عليه من قبل، الزهور كانت أكثر إشراقًا، السماء زرقاء صافية. وشكروا نور لأنها ذكّرتهم بأهمية الحُب والعطاء. وتعلم الجميع أن القِيم الجميلة هي ما يُضفي الألوان على الحياة.\n"
            ], 
            "imgSrc": "images/نور و الالوان المفقودة.jpeg",
            "audioSrc": [
                "audio/our_library/_1نور والالوان المفقوده.mp3",
                "audio/our_library/_2نور والالوان المفقوده.mp3",
                "audio/our_library/_3نور والالوان المفقوده.mp3",
                "audio/our_library/_4نور والالوان المفقوده.mp3"
            ]
        },
        {
            "title": "الفتى المخادع",
            "content":  [
                "في بلدة صغيرة، كان هناك فتى يُدعى “ماهر”، معروفٌ بخداعه ومزاحه الثقيل مع أهل البلدة. في أحد الأيام، أثناء تجوله قرب النهر، عثر على جوهرة صغيرة لامعة. لم تكن الجوهرة ذات قيمة كبيرة، لكنها لفتت انتباهه وخطر في باله فكرة ليمزح مع الناس. عاد ماهر إلى السوق وصرخ بأعلى صوته: “لقد وجدت جوهرة ثمينة جدًا! إنها أغلى جوهرة في العالم!” اجتمع الناس حوله، يتسابقون لرؤية الجوهرة. لكنه أخفى الجوهرة في جيبه وقال: “لا يمكنني أن أريكم إياها الآن. لكنها حقيقية!”\n",
                "بدأ الناس يتحدثون عن الجوهرة في كل مكان، وكان بعضهم مستعدًا لدفع المال لرؤيتها. استمتع ماهر بالموقف، لكنه لم يُظهر الجوهرة أبدًا. في اليوم التالي، قرر أن يرفع مستوى المزاح. ذهب إلى السوق مجددًا وصرخ: “لقد سرق أحدهم جوهرتي الثمينة! أرجوكم، ساعدوني في العثور عليها!”  ركض أهل البلدة يبحثون في كل مكان، حتى أنهم تركوا أعمالهم ليبحثوا عن “الجوهرة المسروقة”.\n",
                "وعندما عادوا إليه وقالوا إنهم لم يجدوا شيئًا، ضحك وقال: “كنت أمزح فقط! لم تُسرق الجوهرة.” غضب أهل البلدة وقالوا: “أنت مخادع! لن نصدقك أبدًا!” بعد أيام قليلة، بينما كان ماهر يلعب قرب النهر، رأى صيادًا عجوزًا يحمل جوهرة كبيرة حقًا، تبدو وكأنها من أغلى الكنوز.\n",
                "صرخ ماهر وركض إلى السوق قائلاً: “لقد وجدت جوهرة حقيقية، هذه المرة ضخمة وثمينة جدًا!” لكن هذه المرة، لم يهتم أحد لكلامه. قالوا له:“نحن نعرفك جيدًا. أنت تكذب دائمًا!” حاول ماهر إقناعهم، لكنه فشل. وفي النهاية، أُخذت الجوهرة الحقيقية إلى مكان آخر، ولم يصدق أحد أن ماهر كان صادقًا هذه المرة.\n"
                ], 
            "imgSrc": "images/الفتى المخادع.jpeg",
            "audioSrc": [
                    "audio/our_library/_1الفتى_المخادع.mp3",
                    "audio/our_library/_2الفتى_المخادع.mp3",
                    "audio/our_library/_3الفتى_المخادع.mp3",
                    "audio/our_library/_4الفتى_المخادع.mp3"
                
            ]
        }
    ]

    with app.app_context():  # الوصول إلى سياق التطبيق
        for story in stories:
            # تحقق إذا كانت القصة موجودة بناءً على العنوان
            existing_story = Available_stories.query.filter_by(title=story['title']).first()
            if not existing_story:
                # إذا لم تكن موجودة، أضفها
                new_story = Available_stories(
                    title=story['title'],
                    content=json.dumps(story['content']),
                    imgSrc=story['imgSrc'],
                    audioSrc=json.dumps(story['audioSrc'])
                )
                db.session.add(new_story)
        db.session.commit()
        print("تمت إضافة القصص إذا لم تكن موجودة.")
# End Add Stories

def create_app():
    app = Flask(__name__)
    app.config['SECRET_KEY'] = os.getenv("SECRET_KEY")
    app.config["SQLALCHEMY_DATABASE_URI"] = f'mysql+pymysql://{DB_USER}:{DB_PASSWORD}@{DB_HOST}/{DB_NAME}'
    app.config["SQLALCHEMY_TRACK_MODIFICATIONS"] = False
    db.init_app(app)  # Bind SQLAlchemy to the app

    from .views import views
    from .auth import auth
    app.register_blueprint(views, url_prefix='/')
    app.register_blueprint(auth, url_prefix='/')

    # Import Tables
    from .models import User, User_stories, Available_stories

    create_database(app)  # Create database and add stories

    login_manager = LoginManager()
    login_manager.login_view = 'auth.login'
    login_manager.init_app(app)

    # تغيير الرسالة الافتراضية
    login_manager.login_message = "الرجاء تسجيل الدخول للوصول إلى هذه الصفحة."
    login_manager.login_message_category = "error"  # اختيار التصنيف (success, error, info, إلخ)

    @login_manager.user_loader
    def load_user(id):
        return User.query.get(int(id))
    return app

def create_database(app):
    with app.app_context():
        db.create_all()  # Create all tables in the database if they don't exist
        add_stories(app, db)  # Pass `app` and `db` to `add_stories`

