# Python Package
from flask import Flask
from flask_login import LoginManager
from .database import db
import json
from .models import Available_stories

DB_NAME = 'mulhem' # Schema Name

# Start Add Stories
def add_stories(app, db):
    stories = [
        {
            "title": "ذات الرداء الأحمر",
            "content":  [
                    "كان يا ما كان، في قديم الزمان، فتاة صغيرة طيبة القلب تُدعى 'ذات الرداء الأحمر'، وذلك بسبب رداء أحمر جميل أهَدته لها جدتها، وكانت ترتديه دائمًا.في يوم من الأيام، قالت لها والدتها:\n'يا ابنتي العزيزة، جدتكِ مريضة وتعيش وحدها في الغابة. خذي لها هذه السلة التي تحتوي على كعك وعصير لتقويتها. تذكري ألا تخرجي عن الطريق، ولا تضيعي الوقت.'\nوعدت ذات الرداء الأحمر أمها بأنها ستكون حذرة، وانطلقت نحو الغابة. كان يومًا مشرقًا، والغابة تبدو هادئة وجميلة.",
                    "بينما كانت ذات الرداء الأحمر تسير في الغابة، ظهر لها ذئب كبير بدا ودودًا.\n\nقال الذئب بمكر: 'إلى أين أنتِ ذاهبة يا صغيرة؟'\n ردت ذات الرداء الأحمر:'أنا ذاهبة إلى بيت جدتي المريضة لأعطيها بعض الطعام.'\nسألها الذئب: 'وأين تعيش جدتكِ؟'\nأجابته:'تحت ثلاثة أشجار بلوط كبيرة في الغابة.'\nفكر الذئب بخطة شريرة وقال: 'ما رأيكِ أن تجمعي بعض الزهور الجميلة لجدتكِ؟ ستفرح كثيرًا بها.'\n\nوافقت ذات الرداء الأحمر، وبدأت تقطف الزهور، مما جعلها تبتعد عن الطريق.",
                    "استغل الذئب فرصة انشغال الفتاة بالزهور وركض سريعًا إلى بيت الجدة. طرق الباب قائلاً بصوت ناعم: 'أنا ذات الرداء الأحمر، أحضرت لكِ كعكًا وعصيرًا.'\nردت الجدة من الداخل: 'ادخلي، الباب مفتوح.'\nدخل الذئب المنزل وانقض على الجدة وأكلها، ثم ارتدى ملابسها واستلقى في سريرها منتظرًا ذات الرداء الأحمر.\nعندما وصلت الفتاة إلى المنزل، لاحظت أن الباب مفتوح قليلاً وشعرت بالقلق. دخلت وقالت: 'صباح الخير يا جدتي!'",
                    "اقتربت ذات الرداء الأحمر من السرير ولاحظت أن 'جدتها' تبدو غريبة. فقالت:'ما أكبر أذنيكِ!' فأجاب الذئب: 'لكي أسمعكِ جيدًا.' \nثم قالت: 'ما أكبر عينيكِ!' فأجاب: 'لكي أراكِ جيدًا.'\nوأخيرًا قالت: 'ما أكبر فمكِ!' فرد الذئب: 'لكي آكلكِ!'\nقفز الذئب وابتلع الفتاة. ولكن لحسن الحظ، كان هناك صياد يمر قرب المنزل. دخل الصياد ورأى الذئب نائمًا، فشَق بطنه ووجد الجدة وذات الرداء الأحمر سالمتين.\nملأ الصياد بطن الذئب بالحجارة وأغلقه. عندما استيقظ الذئب حاول الهرب لكنه سقط ميتًا.\nشكرت ذات الرداء الأحمر وجدتها الصياد على شجاعته، وقالت الفتاة:'تعلمت درسًا. لن أخرج عن الطريق مرة أخرى.' ثم عادت إلى بيتها بأمان."
                    ], 
            "imgSrc": "images/ذات الرداء الأحمر.jpg",
            "audioSrc": [
                "audio/our_library/ذات الرداء الأحمر_1.mp3",
                "audio/our_library/ذات الرداء الأحمر_2.mp3",
                "audio/our_library/ذات الرداء الأحمر_3.mp3",
                "audio/our_library/ذات الرداء الأحمر_4.mp3",
            ]
        },
        {
        "title": "التمرة الضائعة",
        "content": [
            "في قرية صغيرة في نجد، حيث تملأ مزارع النخيل الأفق، عاشت فتاة تُدعى ليان مع عائلتها. والدها كان يرعى مزرعة نخيل ويكرر لها دائمًا: '\nالنخلة رمز الخير، والتمر رزقٌ مبارك.'\n في صباحٍ جميل، وأثناء مساعدتها لوالدها في جمع التمر، لاحظت ليان تمرة كبيرة وشديدة الحلاوة سقطت على الأرض. فرحت بها وقررت الاحتفاظ بها لتأكلها لاحقًا، فوضعتها بعناية في حقيبتها الصغيرة.",
            "عندما عادت ليان للمنزل، اكتشفت أن التمرة اختفت، ما أشعرها بالحزن والقلق. فكرت مليًا وسألت نفسها: '\nأين ذهبت التمرة؟ هل سقطت في الطريق، أم أخذها أحد؟'\n لم تستسلم وقررت العودة إلى المزرعة للبحث عنها. أثناء سيرها، لاحظت آثار أقدام صغيرة تقود إلى زاوية في الحقل. عندما تتبعتها، اكتشفت أن عصفورًا ضعيفًا يحاول كسر التمرة لكنه لم يستطع ذلك.",
            "اقتربت ليان بهدوء من العصفور وقالت بابتسامة: '\nأنت من أخذ التمرة! ثم نظرت إليه ورأت أنه يبدو جائعًا وضعيفًا.'\n بعد تردد بسيط، فكرت في أن التمرة قد تكون رزقًا للعصفور كما أن التمور رزق لعائلتها. قررت أن تساعده؛ حملت التمرة وساعدته على كسرها '\n. أكل العصفور بشهية، ثم بدأ يرفرف حول ليان وكأنه يشكرها على فعلتها الطيبة.",
            "عادت ليان إلى المنزل وحكت الحكاية لوالدها، الذي ابتسم بفخر وقال لها: '\nيا ليان، الخير لا يُحفظ، بل يُعطى. الله يرزق الجميع، ومن يعطي يُبارك له.\n تعلمت ليان درسًا مهمًا: أن السعادة تكمن في مساعدة الآخرين، وأن الرحمة تشمل كل مخلوقات الله. أدركت أن العطاء يجلب الفرح الحقيقي، ولو كان بسيطًا، كتمرةٍ شاركتها مع عصفور صغير."
        ],
        "imgSrc": "images/التمرة الضائعة.jpeg",
        "audioSrc": [
            "audio/our_library/التمره الضائعة_1.mp3",
            "audio/our_library/التمره الضائعة_2.mp3",
            "audio/our_library/التمره الضائعة_3.mp3",
            "audio/our_library/التمره الضائعة_4.mp3"
        ]
        },
        {
            "title": "الأرنب المشاغب باسل",
            "content":  [
                    "في غابة جميلة، عاشت الأرنبة لينا مع أبنائها الأربعة: فلة، مرمر، روان، وباسل، تحت شجرة كبيرة. كانت دائمًا تحذرهم من المخاطر.\nفي صباحٍ هادئ، قالت لهم بلهجة جادة: 'لا تدخلوا حديقة السيد محمود. رغم أن فيها خضروات شهية، إلا أنها مليئة بالمصائد. والدكم وقع في واحدة هناك' وافق الجميع على التحذير.\nبينما خرجت فلة ومرمر وروان لجمع التوت، قرر باسل تجاهل التحذير والمغامرة.",
                    "انتظر باسل حتى غادر الجميع ثم توجه للحديقة.\nوجد الباب مفتوحًا قليلاً، فانسل إلى الداخل.\nاندهش برؤية الجزر، الخس، والخضروات الطازجة. بدأ يأكل بشراهة، ناسيًا تحذير والدته. \nوبينما كان يستمتع، سمع صوت خطوات خلفه.\nاستدار ليجد السيد محمود يقترب حاملاً عصاه وهو يصرخ: 'أيها الأرنب اللص!' حاول باسل الهرب، لكنه علقت قدماه في شبكة صغيرة.",
                    "علق باسل بالشبكة، لكنه بذل جهدًا كبيرًا لتحرير نفسه. فقد معطفه وحذاءيه الجديدين، وركض بأسرع ما يمكن.\n بحث عن مخرج فرأى نافذة صغيرة في سقيفة الأدوات وقفز منها بصعوبة.\n عندما خرج، ركض نحو بوابة الحديقة المفتوحة واندفع إلى الخارج.\n ظل يجري بين الأشجار حتى تأكد أن السيد محمود لم يعد يلاحقه. وصل إلى البيت منهكًا ومبللًا، وشعر بالخجل من والدته.",
                    "رأت الأم حالة باسل المتعبة فقالت بهدوء: 'ما الذي حدث؟' روى لها القصة وهو يشعر بالخجل.\n قالت الأم: 'لقد فقدت معطفك وحذاءيك، لكنك تعلمت درسًا مهمًا اليوم.\n' أحضرت له شاي دافئا ليساعده على الراحة.\n بينما تناول إخوته العشاء، شعر باسل بالحزن لأنه لم يشاركهم.\n قبل النوم، وعد والدته أن يلتزم بنصائحها دائمًا.\n نام مطمئنًا وقد تعلم أن الطاعة تحمي من الأخطار."
                    ], 
            "imgSrc": "images/الأرنب المشاغب.jpeg",
            "audioSrc": [
                "audio/our_library/الأرنب المشاغب_1.mp3",
                "audio/our_library/الأرنب المشاغب_2.mp3",
                "audio/our_library/الأرنب المشاغب_3.mp3",
                "audio/our_library/الأرنب المشاغب_4.mp3",
            ]
        },
        {
            "title": "راكان والكنز ",
            "content": [
                "في قرية صغيرة بالقرب من جبال عسير، كان هناك فتى صغير يُدعى \"راكان\". كان يعيش مع جده الحكيم الذي يحب سرد القصص. ذات يوم، أعطى الجد راكان خريطة قديمة قائلاً: \"هذه تقود إلى كنز ثمين، لكنه ليس كنزًا عاديًا. عليك أن تُظهر شجاعتك وذكاءك لتجده.\" انطلق راكان في المغامرة بحماسة. بدأ بالتوجه إلى واحة صغيرة كما أوضحت الخريطة.",
                "تابع راكان رحلته حتى وصل إلى سفح جبل. وجد هناك طفلًا يبكي لأنه فقد عنزته. قرر راكان أن يساعده، فبحث معه في كل مكان حتى وجد العنز الصغيرة عالقة بين الصخور. قال الطفل: \"شكراً يا راكان! أنت بطل حقيقي.\" بعد مساعدة الطفل، شعر راكان بالفرح والرضا، وتأكد أن الخير الذي يقدمه للآخرين هو مكافأة بحد ذاته. عاد للتركيز على الخريطة التي قادته هذه المرة عبر وادٍ مليء بالصخور.",
                "عندما عبر راكان الوادي، وجد مزارعًا يحاول حماية حقله من مجموعة من الطيور التي كانت تأكل المحاصيل. قرر راكان مساعدته، فجمع بعض الأغصان وصنع دمية تخيف الطيور. قال المزارع: \"جزاك الله خيرًا يا بني! أنت حقًا شخص نادر.\" ابتسم راكان وأكمل رحلته. أخيرًا، وصلت الخريطة به إلى كهف صغير كما أشارت الإرشادات. كانت أضواء الشمس الخافتة تتسلل من بين الصخور، مما أضفى أجواءً ساحرة على المكان.",
                "داخل الكهف، وجد راكان صندوقًا صغيرًا. عندما فتحه، لم يجد الذهب أو المجوهرات، بل وجد رسالة مكتوبة بخط جده. كان مكتوبًا فيها: \"يا راكان، الكنز الحقيقي ليس في المال، بل في الخير الذي تزرعه في قلوب الناس. الرحمة والشجاعة هما أغلى ما يمكن أن تملكه. أنا فخور بك.\" عاد راكان إلى جده مبتسمًا، وقال: \"الكنز كان أكبر مما توقعت يا جدي. تعلمت أن الكرم والشجاعة هما ما يجعلنا أغنياء حقًا.\""
            ],
            "imgSrc": "images/راكان والكنز .jpeg",
            "audioSrc": [
                "audio/our_library/راكان والكنز 1.mp3",
                "audio/our_library/راكان والكنز 2.mp3",
                "audio/our_library/راكان والكنز 3.mp3",
                "audio/our_library/راكان والكنز 4.mp3"
            ]
        },
        {
            "title":"علاء الدين",
            "content": [
                "في قَديمِ الزمانِ، كانَ هناكَ شابٌّ فَقيرٌ يُدعى 'علاءُ الدِّينِ' يعيشُ مع والدتِهِ في بَلدةٍ صغيرةٍ. كانَ علاءُ الدِّينُ مَعرُوفًا بِفُضُولِهِ وحُبِّهِ لِلمَغامَرَةِ.\nفي يَومٍ مِنَ الأَيَّامِ، وَصَلَ إلى البَلدةِ رَجُلٌ غريبٌ ادَّعى أَنَّهُ عَمُّ علاءِ الدِّينِ.\nلكنَّهُ في الحَقيقَةِ كانَ ساحِرًا شِرِّيرًا يَبحَثُ عن كَنزٍ سِحريٍّ مَخفِيٍّ في كَهفٍ بَعيدٍ.",
                "أَقنَعَ السَّاحِرُ علاءَ الدِّينِ بِمُساعدَتِهِ لاستِعادَةِ الكَنزِ السِّحريِّ، ووَعَدَهُ بِمُكافَأَةٍ كَبيرةٍ.\nداخِلَ الكَهفِ، وَجَدَ علاءُ الدِّينُ مِصبَاحًا قَديمًا.\nلكنَّ السَّاحِرَ غَدَرَ بِهِ وَتَرَكَهُ مَحصُورًا في الدَّاخلِ.\nفَرَكَ علاءُ الدِّينُ المِصبَاحَ بِيَأسٍ، فَظَهَرَ جِنِّيٌّ قَوِيٌّ يَقُولُ: 'أَنَا خَادِمُ المِصبَاحِ، مُرني وَسَأُطِيعُكَ.'",
                "طَلَبَ علاءُ الدِّينُ مِنَ الجِنِّيِّ أَن يُحرِّرَهُ مِنَ الكَهفِ، وَعَادَ إلى المَنزِلِ بِسَلامٍ.\nاستَخدَمَ علاءُ الدِّينُ قُوَّةَ الجِنِّيِّ لِتحسِينِ حَياتِهِ وَحَياةِ والدَتِهِ.\nأَصبَحَ ثَرِيًّا، وَبَنَى قَصرًا رائِعًا، وَقَرَّرَ أَن يَطلُبَ يَدَ الأَمِيرَةِ بَدْرِ البُدورِ، أَجمَلِ فَتاةٍ في المَملَكَةِ.",
                "لكنَّ السَّاحِرَ الشِّرِّيرَ خَدَعَ الأَمِيرَةَ وسَرَقَ المِصبَاحَ، مُحاوِلًا تَدمِيرَ علاءِ الدِّينِ.\nبِشَجاعَتِهِ وَذَكَائِهِ، استَعادَ علاءُ الدِّينُ المِصبَاحَ وَهَزَمَ السَّاحِرَ.\nتَعَلَّمَ علاءُ الدِّينُ أَنَّ القُوَّةَ الحَقيقِيَّةَ تَكمُنُ في الشَّجاعَةِ وَالذَّكَاءِ، وَعَاشَ مَعَ الأَمِيرَةِ بِسَعادَةٍ إِلَى الأَبَدِ."
            ],
            "imgSrc": "/images/علاء الدين.jpeg",
            "audioSrc": [
                "audio/our_library/علاء الدين1.mp3",
                "audio/our_library/علاء الدين2.mp3",
                "audio/our_library/علاء الدين3.mp3",
                "audio/our_library/علاء الدين4.mp3"
            ],
        {
            "title": "جاك وحبة الفاصولياء",
            "content": [
                "في قَديمِ الزمانِ، كانَ جاكُ يعيشُ مع والدتِهِ الأرملةِ في فَقرٍ شَديدٍ.\nكانتِ العائلةُ تعتمدُ على بَقَرَةٍ اسمُها 'أَبيضُ الحَليبِ' لِتَوفيرِ الطَّعامِ.\nلكنَّ البَقَرَةَ توقَّفَت عن إنتَاجِ الحَليبِ.\nطَلَبَت الأُمُّ من جاك أنْ يَبيعَ البَقَرَةَ في السُّوقِ لِيَشتري الطَّعامَ.\nفي طريقِهِ، التقى جاكُ برَجُلٍ غامِضٍ عَرَضَ عليهِ خَمسَ حَبَّاتِ فاصولياءِ سِحريَّةٍ مُقابِلَ البَقَرَةِ.",
            "imgSrc": "images/جاك وحبة الفاصولياء.png",
            "audioSrc": [
                "audio/our_library/جاك1.mp3",
                "audio/our_library/جاك2.mp3",
                "audio/our_library/جاك3.mp3",
                "audio/our_library/جاك4.mp3"
            ],
    ]

    with app.app_context():  # الوصول إلى سياق التطبيق
        for story in stories:
            # تحقق إذا كانت القصة موجودة بناءً على العنوان
            existing_story = Available_stories.query.filter_by(title=story['title']).first()
            if not existing_story:
                # إذا لم تكن موجودة، أضفها
                new_story = Available_stories(
                    title=story['title'],
                    content=json.dumps(story['content']),
                    imgSrc=story['imgSrc'],
                    audioSrc=json.dumps(story['audioSrc'])
                )
                db.session.add(new_story)
        db.session.commit()
        print("تمت إضافة القصص إذا لم تكن موجودة.")
# End Add Stories

def create_app():
    app = Flask(__name__)
    app.config['SECRET_KEY'] = 'Mulhem2025GP'
    app.config["SQLALCHEMY_DATABASE_URI"] = f'mysql+pymysql://root:1234@localhost/{DB_NAME}'
    app.config["SQLALCHEMY_TRACK_MODIFICATIONS"] = False
    db.init_app(app)  # Bind SQLAlchemy to the app

    from .views import views
    from .auth import auth
    app.register_blueprint(views, url_prefix='/')
    app.register_blueprint(auth, url_prefix='/')

    # Import Tables
    from .models import User, User_stories, Available_stories

    create_database(app)  # Create database and add stories

    login_manager = LoginManager()
    login_manager.login_view = 'auth.login'
    login_manager.init_app(app)

    # تغيير الرسالة الافتراضية
    login_manager.login_message = "الرجاء تسجيل الدخول للوصول إلى هذه الصفحة."
    login_manager.login_message_category = "error"  # اختيار التصنيف (success, error, info, إلخ)

    @login_manager.user_loader
    def load_user(id):
        return User.query.get(int(id))
    return app

def create_database(app):
    with app.app_context():
        db.create_all()  # Create all tables in the database if they don't exist
        add_stories(app, db)  # Pass `app` and `db` to `add_stories`

