

# تصحيح الأخطاء
user_input = "في غابتن حلوة،هناك أرنب جميل وذئبن مخيف وخايس"
correction_ptompt = f"""Input: صحح الأخطاء: كان هناك ولد يدعى أحمدون كيوت وطيب،لكنه يقابل شخصا ذو وجهه معفن يؤذيه.
Output: {{
    "spelling": [["صباح", "صباحن"], ["أحمد", "أحمدون"]],
    "grammar": [["جميل", "حلو"], ["لطيف", "كيوت"]],
	"inappropriate_words": [["المعفن", "القاسي"]]
}}
Input: صحح الأخطاء: كان هناك ولد يدعى أحمد.
Output: {{}}
Input: صحح الأخطاء: كان هناك ولد يدعى أحمدون.
Output: {{
"spelling": [["أحمد", "أحمدون"]],
    "grammar": [],
	"inappropriate_words": []
}}
Input: صحح الأخطاء: {user_input}
Output:"""
max_tokens = 3000

# عناصر القصة
user_input = "في غابة جميلة،هناك أرنب جميل وذئب مخيف"
correction_ptompt = f"""Input: استخرج عناصر القصة الأساسية (الشخصيات، المكان، الزمان، الأسباب، المعضلة) من النص التالي: في صباح جميل كان هناك ولد يدعى أحمد
Output: {{
    "العناصر مكتملة": false,
    ".الشخصيات": "أحمد",
    "المكان": "غير مذكور. أين يمكن أن يكون أحمد؟ في المنزل، المدرسة، أم مكان آخر؟",
    ".الزمان": "صباح جميل",
    "الأسباب": "غير مذكورة. لماذا أحمد في هذا المكان؟ هل هو ذاهب لإنجاز شيء مهم أم لمجرد التسلية؟",
    "المعضلة": "غير مذكورة. ما المشكلة أو التحدي الذي يواجه أحمد في هذه القصة؟"
}}
Input: استخرج عناصر القصة الأساسية (الشخصيات، المكان، الزمان، الأسباب، المعضلة) من النص التالي:{user_input}
Output:"""
max_tokens = 500


# إكمال القصة
user_input = "في غابتن حلوة،هناك أرنب جميل وذئبن مخيف وخايس"
correction_ptompt = f"""Input: ساعد الطفل في إكمال القصة عن طريق تشجيعه ثم طرح اسئلة مساعدة: في صباح جميل كان هناك ولد يدعى أحمد
Output: أحسنت! قصتك جميلة جدًا. أين يمكن أن يكون أحمد؟ هل يساعد أصدقائه في المدرسة أم في الحي؟
Input: ساعد الطفل في إكمال القصة عن طريق تشجيعه ثم طرح اسئلة مساعدة:{user_input}
Output:"""
max_tokens = 250


# النشاط الأول
user_input = "عن ليلى اللتي لم ذهبت إلى المدرسة."
activity1_1_ptompt = f"""Input: النص: يتحدث عن قصة ليلى والذئب المعروفة.
السؤال: عن ماذا يتحدث النص؟
الجواب: عن ليلى اللتي لم تستمع إلى امها.
Output: true
Input: الجواب:{user_input}
Output:"""

user_input = "عن الذئب وحياته"
activity1_2_ptompt = f"""Input: النص: يتحدث عم معلومات وحقائق عن الذئب.
السؤال: عن ماذا يتحدث النص؟
الجواب: عن الذئب وليلى.
Output: false
Input: الجواب:{user_input}
Output:"""
max_tokens = 10

